Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMR30_DFP/2.0.32/Microchip.SAMR30_DFP.pdsc
      <condition id="ATSAMR30G18A">
         <require Dvendor="Microchip:3" Dname="ATSAMR30G18A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
   </conditions>
   <components>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="ATSAMR30E18A">
         <description>Headers and startup code for Microchip ATSAMR30E18A</description>
         <files>
            <file condition="C" category="include" name="include/"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_samr30e18a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_samr30e18a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/samr30e18a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/samr30e18a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_samr30e18a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_samr30e18a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_samr30e18a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_samr30e18a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/iar/samr30e18a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/iar/samr30e18a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip" Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="ATSAMR30G18A">
         <description>Headers and startup code for Microchip ATSAMR30G18A</description>
         <files>
            <file condition="C" category="include" name="include/"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_samr30g18a.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/system_samr30g18a.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/samr30g18a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/samr30g18a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/armcc/startup_samr30g18a.s" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/system_samr30g18a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_samr30g18a.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_samr30g18a.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/iar/samr30g18a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/iar/samr30g18a_sram.icf" attr="config"/>
         </files>
      </component>
   </components>
</package>
